7767517
332 380
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=7 11=7 12=1 13=2 14=3 2=1 3=2 4=3 5=1 6=2352 9=1
Pooling                  maxpool2d_155            1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_1               1 1 4 5 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
Split                    splitncnn_1              1 4 5 6 7 8 9
Convolution              conv_29                  1 1 9 10 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_0             1 1 10 11 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_2              1 2 11 12 13
Convolution              conv_30                  1 1 8 14 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_1             1 1 14 15 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_31                  1 1 15 16 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_2             1 1 16 17 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_3              1 2 17 18 19
Convolution              conv_32                  1 1 7 20 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_3             1 1 20 21 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_33                  1 1 21 22 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_4             1 1 22 23 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_34                  1 1 23 24 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_5             1 1 24 25 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_4              1 2 25 26 27
Convolution              conv_35                  1 1 6 28 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_6             1 1 28 29 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_36                  1 1 29 30 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_7             1 1 30 31 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_37                  1 1 31 32 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_8             1 1 32 33 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_38                  1 1 33 34 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_9             1 1 34 35 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_5              1 2 35 36 37
Pooling                  gap_0                    1 1 13 38 0=1 4=1
Convolution              convrelu_2               1 1 38 39 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_34           1 1 39 40 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Pooling                  gap_1                    1 1 19 41 0=1 4=1
Convolution              convrelu_3               1 1 41 42 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_35           1 1 42 43 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Pooling                  gap_2                    1 1 27 44 0=1 4=1
Convolution              convrelu_4               1 1 44 45 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_36           1 1 45 46 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Pooling                  gap_3                    1 1 37 47 0=1 4=1
Convolution              convrelu_5               1 1 47 48 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_37           1 1 48 49 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Reshape                  reshape_281              1 1 49 50 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 36 50 51 0=2
Reshape                  reshape_282              1 1 46 52 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 26 52 53 0=2
Reshape                  reshape_283              1 1 43 54 0=1 1=1 2=-1
BinaryOp                 mul_2                    2 1 18 54 55 0=2
Reshape                  reshape_284              1 1 40 56 0=1 1=1 2=-1
BinaryOp                 mul_3                    2 1 12 56 57 0=2
BinaryOp                 add_4                    2 1 57 55 58 0=0
BinaryOp                 add_5                    2 1 58 53 59 0=0
BinaryOp                 add_6                    2 1 59 51 60 0=0
Convolution              conv_47                  1 1 60 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Convolution              conv_48                  1 1 3 62 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_7                    2 1 61 62 63 0=0
ReLU                     relu_275                 1 1 63 64
Split                    splitncnn_6              1 2 64 65 66
Convolution              convrelu_6               1 1 66 67 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Split                    splitncnn_7              1 4 67 68 69 70 71
Convolution              conv_50                  1 1 71 72 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_10            1 1 72 73 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_8              1 2 73 74 75
Convolution              conv_51                  1 1 70 76 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_11            1 1 76 77 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_52                  1 1 77 78 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_12            1 1 78 79 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_9              1 2 79 80 81
Convolution              conv_53                  1 1 69 82 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_13            1 1 82 83 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_54                  1 1 83 84 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_14            1 1 84 85 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_55                  1 1 85 86 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_15            1 1 86 87 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_10             1 2 87 88 89
Convolution              conv_56                  1 1 68 90 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_16            1 1 90 91 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_57                  1 1 91 92 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_17            1 1 92 93 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_58                  1 1 93 94 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_18            1 1 94 95 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_59                  1 1 95 96 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=256
ConvolutionDepthWise     convdwrelu_19            1 1 96 97 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_11             1 2 97 98 99
Pooling                  gap_4                    1 1 75 100 0=1 4=1
Convolution              convrelu_7               1 1 100 101 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_38           1 1 101 102 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Pooling                  gap_5                    1 1 81 103 0=1 4=1
Convolution              convrelu_8               1 1 103 104 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_39           1 1 104 105 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Pooling                  gap_6                    1 1 89 106 0=1 4=1
Convolution              convrelu_9               1 1 106 107 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_40           1 1 107 108 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Pooling                  gap_7                    1 1 99 109 0=1 4=1
Convolution              convrelu_10              1 1 109 110 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              convsigmoid_41           1 1 110 111 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
Reshape                  reshape_285              1 1 111 112 0=1 1=1 2=-1
BinaryOp                 mul_8                    2 1 98 112 113 0=2
Reshape                  reshape_286              1 1 108 114 0=1 1=1 2=-1
BinaryOp                 mul_9                    2 1 88 114 115 0=2
Reshape                  reshape_287              1 1 105 116 0=1 1=1 2=-1
BinaryOp                 mul_10                   2 1 80 116 117 0=2
Reshape                  reshape_288              1 1 102 118 0=1 1=1 2=-1
BinaryOp                 mul_11                   2 1 74 118 119 0=2
BinaryOp                 add_12                   2 1 119 117 120 0=0
BinaryOp                 add_13                   2 1 120 115 121 0=0
BinaryOp                 add_14                   2 1 121 113 122 0=0
Convolution              conv_68                  1 1 122 123 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_15                   2 1 123 65 124 0=0
ReLU                     relu_276                 1 1 124 125
Convolution              convrelu_11              1 1 125 126 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Pooling                  avgpool2d_25             1 1 126 127 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Split                    splitncnn_12             1 2 127 128 129
Convolution              convrelu_12              1 1 129 130 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
Split                    splitncnn_13             1 4 130 131 132 133 134
Convolution              conv_71                  1 1 134 135 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_20            1 1 135 136 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_14             1 2 136 137 138
Convolution              conv_72                  1 1 133 139 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_21            1 1 139 140 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_73                  1 1 140 141 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_22            1 1 141 142 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_15             1 2 142 143 144
Convolution              conv_74                  1 1 132 145 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_23            1 1 145 146 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_75                  1 1 146 147 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_24            1 1 147 148 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_76                  1 1 148 149 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_25            1 1 149 150 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_16             1 2 150 151 152
Convolution              conv_77                  1 1 131 153 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_26            1 1 153 154 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_78                  1 1 154 155 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_27            1 1 155 156 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_79                  1 1 156 157 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_28            1 1 157 158 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_80                  1 1 158 159 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_29            1 1 159 160 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_17             1 2 160 161 162
Pooling                  gap_8                    1 1 138 163 0=1 4=1
Convolution              convrelu_13              1 1 163 164 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_42           1 1 164 165 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Pooling                  gap_9                    1 1 144 166 0=1 4=1
Convolution              convrelu_14              1 1 166 167 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_43           1 1 167 168 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Pooling                  gap_10                   1 1 152 169 0=1 4=1
Convolution              convrelu_15              1 1 169 170 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_44           1 1 170 171 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Pooling                  gap_11                   1 1 162 172 0=1 4=1
Convolution              convrelu_16              1 1 172 173 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_45           1 1 173 174 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Reshape                  reshape_289              1 1 174 175 0=1 1=1 2=-1
BinaryOp                 mul_16                   2 1 161 175 176 0=2
Reshape                  reshape_290              1 1 171 177 0=1 1=1 2=-1
BinaryOp                 mul_17                   2 1 151 177 178 0=2
Reshape                  reshape_291              1 1 168 179 0=1 1=1 2=-1
BinaryOp                 mul_18                   2 1 143 179 180 0=2
Reshape                  reshape_292              1 1 165 181 0=1 1=1 2=-1
BinaryOp                 mul_19                   2 1 137 181 182 0=2
BinaryOp                 add_20                   2 1 182 180 183 0=0
BinaryOp                 add_21                   2 1 183 178 184 0=0
BinaryOp                 add_22                   2 1 184 176 185 0=0
Convolution              conv_89                  1 1 185 186 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Convolution              conv_90                  1 1 128 187 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_23                   2 1 186 187 188 0=0
ReLU                     relu_277                 1 1 188 189
Split                    splitncnn_18             1 2 189 190 191
Convolution              convrelu_17              1 1 191 192 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Split                    splitncnn_19             1 4 192 193 194 195 196
Convolution              conv_92                  1 1 196 197 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_30            1 1 197 198 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_20             1 2 198 199 200
Convolution              conv_93                  1 1 195 201 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_31            1 1 201 202 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_94                  1 1 202 203 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_32            1 1 203 204 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_21             1 2 204 205 206
Convolution              conv_95                  1 1 194 207 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_33            1 1 207 208 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_96                  1 1 208 209 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_34            1 1 209 210 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_97                  1 1 210 211 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_35            1 1 211 212 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_22             1 2 212 213 214
Convolution              conv_98                  1 1 193 215 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_36            1 1 215 216 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_99                  1 1 216 217 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_37            1 1 217 218 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_100                 1 1 218 219 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_38            1 1 219 220 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Convolution              conv_101                 1 1 220 221 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=576
ConvolutionDepthWise     convdwrelu_39            1 1 221 222 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24 9=1
Split                    splitncnn_23             1 2 222 223 224
Pooling                  gap_12                   1 1 200 225 0=1 4=1
Convolution              convrelu_18              1 1 225 226 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_46           1 1 226 227 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Pooling                  gap_13                   1 1 206 228 0=1 4=1
Convolution              convrelu_19              1 1 228 229 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_47           1 1 229 230 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Pooling                  gap_14                   1 1 214 231 0=1 4=1
Convolution              convrelu_20              1 1 231 232 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_48           1 1 232 233 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Pooling                  gap_15                   1 1 224 234 0=1 4=1
Convolution              convrelu_21              1 1 234 235 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=1
Convolution              convsigmoid_49           1 1 235 236 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24 9=4
Reshape                  reshape_293              1 1 236 237 0=1 1=1 2=-1
BinaryOp                 mul_24                   2 1 223 237 238 0=2
Reshape                  reshape_294              1 1 233 239 0=1 1=1 2=-1
BinaryOp                 mul_25                   2 1 213 239 240 0=2
Reshape                  reshape_295              1 1 230 241 0=1 1=1 2=-1
BinaryOp                 mul_26                   2 1 205 241 242 0=2
Reshape                  reshape_296              1 1 227 243 0=1 1=1 2=-1
BinaryOp                 mul_27                   2 1 199 243 244 0=2
BinaryOp                 add_28                   2 1 244 242 245 0=0
BinaryOp                 add_29                   2 1 245 240 246 0=0
BinaryOp                 add_30                   2 1 246 238 247 0=0
Convolution              conv_110                 1 1 247 248 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
BinaryOp                 add_31                   2 1 248 190 249 0=0
ReLU                     relu_278                 1 1 249 250
Convolution              convrelu_22              1 1 250 251 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Pooling                  avgpool2d_26             1 1 251 252 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Split                    splitncnn_24             1 2 252 253 254
Convolution              convrelu_23              1 1 254 255 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072 9=1
Split                    splitncnn_25             1 4 255 256 257 258 259
Convolution              conv_113                 1 1 259 260 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_40            1 1 260 261 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_26             1 2 261 262 263
Convolution              conv_114                 1 1 258 264 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_41            1 1 264 265 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_115                 1 1 265 266 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_42            1 1 266 267 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_27             1 2 267 268 269
Convolution              conv_116                 1 1 257 270 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_43            1 1 270 271 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_117                 1 1 271 272 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_44            1 1 272 273 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_118                 1 1 273 274 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_45            1 1 274 275 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_28             1 2 275 276 277
Convolution              conv_119                 1 1 256 278 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_46            1 1 278 279 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_120                 1 1 279 280 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_47            1 1 280 281 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_121                 1 1 281 282 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_48            1 1 282 283 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_122                 1 1 283 284 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_49            1 1 284 285 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_29             1 2 285 286 287
Pooling                  gap_16                   1 1 263 288 0=1 4=1
Convolution              convrelu_24              1 1 288 289 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_50           1 1 289 290 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Pooling                  gap_17                   1 1 269 291 0=1 4=1
Convolution              convrelu_25              1 1 291 292 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_51           1 1 292 293 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Pooling                  gap_18                   1 1 277 294 0=1 4=1
Convolution              convrelu_26              1 1 294 295 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_52           1 1 295 296 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Pooling                  gap_19                   1 1 287 297 0=1 4=1
Convolution              convrelu_27              1 1 297 298 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_53           1 1 298 299 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Reshape                  reshape_297              1 1 299 300 0=1 1=1 2=-1
BinaryOp                 mul_32                   2 1 286 300 301 0=2
Reshape                  reshape_298              1 1 296 302 0=1 1=1 2=-1
BinaryOp                 mul_33                   2 1 276 302 303 0=2
Reshape                  reshape_299              1 1 293 304 0=1 1=1 2=-1
BinaryOp                 mul_34                   2 1 268 304 305 0=2
Reshape                  reshape_300              1 1 290 306 0=1 1=1 2=-1
BinaryOp                 mul_35                   2 1 262 306 307 0=2
BinaryOp                 add_36                   2 1 307 305 308 0=0
BinaryOp                 add_37                   2 1 308 303 309 0=0
BinaryOp                 add_38                   2 1 309 301 310 0=0
Convolution              conv_131                 1 1 310 311 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_132                 1 1 253 312 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
BinaryOp                 add_39                   2 1 311 312 313 0=0
ReLU                     relu_279                 1 1 313 314
Split                    splitncnn_30             1 2 314 315 316
Convolution              convrelu_28              1 1 316 317 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_31             1 4 317 318 319 320 321
Convolution              conv_134                 1 1 321 322 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_50            1 1 322 323 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_32             1 2 323 324 325
Convolution              conv_135                 1 1 320 326 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_51            1 1 326 327 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_136                 1 1 327 328 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_52            1 1 328 329 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_33             1 2 329 330 331
Convolution              conv_137                 1 1 319 332 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_53            1 1 332 333 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_138                 1 1 333 334 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_54            1 1 334 335 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_139                 1 1 335 336 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_55            1 1 336 337 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_34             1 2 337 338 339
Convolution              conv_140                 1 1 318 340 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_56            1 1 340 341 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_141                 1 1 341 342 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_57            1 1 342 343 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_142                 1 1 343 344 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_58            1 1 344 345 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_143                 1 1 345 346 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
ConvolutionDepthWise     convdwrelu_59            1 1 346 347 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Split                    splitncnn_35             1 2 347 348 349
Pooling                  gap_20                   1 1 325 350 0=1 4=1
Convolution              convrelu_29              1 1 350 351 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_54           1 1 351 352 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Pooling                  gap_21                   1 1 331 353 0=1 4=1
Convolution              convrelu_30              1 1 353 354 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_55           1 1 354 355 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Pooling                  gap_22                   1 1 339 356 0=1 4=1
Convolution              convrelu_31              1 1 356 357 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_56           1 1 357 358 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Pooling                  gap_23                   1 1 349 359 0=1 4=1
Convolution              convrelu_32              1 1 359 360 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              convsigmoid_57           1 1 360 361 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Reshape                  reshape_301              1 1 361 362 0=1 1=1 2=-1
BinaryOp                 mul_40                   2 1 348 362 363 0=2
Reshape                  reshape_302              1 1 358 364 0=1 1=1 2=-1
BinaryOp                 mul_41                   2 1 338 364 365 0=2
Reshape                  reshape_303              1 1 355 366 0=1 1=1 2=-1
BinaryOp                 mul_42                   2 1 330 366 367 0=2
Reshape                  reshape_304              1 1 352 368 0=1 1=1 2=-1
BinaryOp                 mul_43                   2 1 324 368 369 0=2
BinaryOp                 add_44                   2 1 369 367 370 0=0
BinaryOp                 add_45                   2 1 370 365 371 0=0
BinaryOp                 add_46                   2 1 371 363 372 0=0
Convolution              conv_152                 1 1 372 373 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_47                   2 1 373 315 374 0=0
ReLU                     relu_280                 1 1 374 375
Convolution              convrelu_33              1 1 375 376 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Pooling                  gap_24                   1 1 376 377 0=1 4=1
Reshape                  view_305                 1 1 377 378 0=128
InnerProduct             fcrelu_0                 1 1 378 out0 0=512 1=1 2=65536 9=1
